jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
#include "usr_ble.h"

// Include utilities
#include "usr_util.h"

#include "usr_ble_settings.h"

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"

#if defined (UART_PRESENT)
#include "nrf_uart.h"
#endif
#if defined (UARTE_PRESENT)
#include "nrf_uarte.h"
#endif

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "nrf_delay.h"

// TimeSync
#include "time_sync.h"
#include "nrf_gpiote.h"
#include "nrf_ppi.h"
#include "nrf_timer.h"

// IMU params
#include "imu_params.h"
#include "imu.h"
extern IMU imu;
extern imu_data_t imu_data;

// Application scheduler
#include "app_scheduler.h"

// Add TMS service for transmitting IMU data
#include "ble_tms.h"

// BLE Battery service
#include "ble_bas.h"


// Variable to keep track if the NUS buffer is full
bool nus_buffer_full = false;


// Struct to keep track of TimeSync variables
typedef struct{
    uint32_t sync_interval_int_time; // How much time between measurements - (In increments of 2.5 ms)
    bool m_ts_synchronized;
    bool m_imu_trigger_enabled;
} time_sync_t;

time_sync_t ts = {
    .sync_interval_int_time = 4, // Default 100 Hz transmission rate
    .m_ts_synchronized = 0,
    .m_imu_trigger_enabled = 0,
};


// Initialization

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

BLE_BAS_DEF(m_bas);                                                                 /**< Structure used to identify the battery service. */
ble_tms_t m_tms;                                                                    /**< Motion service */





static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
//static uint16_t   m_ble_nus_max_data_len = 247 - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */


static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE},
    {BLE_UUID_TMS_SERVICE, TMS_SERVICE_UUID_TYPE}, // Added for TMS service
    {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE}
};



// Motion service event handler
static void ble_tms_evt_handler(ble_tms_t        * p_tms,
                                ble_tms_evt_type_t evt_type,
                                uint8_t          * p_data,
                                uint16_t           length)
{
    NRF_LOG_DEBUG("ble_tms_evt_handler called");
    ret_code_t err_code;
    
    switch (evt_type)
    {
        case BLE_TMS_EVT_NOTIF_TAP:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_TAP - %d\r\n", p_tms->is_tap_notif_enabled);
            // if (p_tms->is_tap_notif_enabled)
            // {
            //     err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_TAP);
            //     APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_TAP);
            //     APP_ERROR_CHECK(err_code);
            // }
            break;

        case BLE_TMS_EVT_NOTIF_ADC:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_ADC - %d\r\n", p_tms->is_adc_notif_enabled);
            // if (p_tms->is_orientation_notif_enabled)
            // {
            //     imu.quat6_enabled = 1;
                
            //     // err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_ORIENTATION);
            //     // APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     imu.quat6_enabled = 0;

            //     // err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_ORIENTATION);
            //     // APP_ERROR_CHECK(err_code);
            // }

            // // Pass change IMU settings to event handler
            // err_code = app_sched_event_put(0, 0, imu_config_evt_sceduled);
            // APP_ERROR_CHECK(err_code);
            break;

        case BLE_TMS_EVT_NOTIF_QUAT:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_QUAT - %d\r\n", p_tms->is_quat_notif_enabled);
            // if (p_tms->is_quat_notif_enabled)
            // {
            //     imu.quat6_enabled = 1;
                
            //     // err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_QUAT);
            //     // APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     imu.quat6_enabled = 0;

            //     // err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_QUAT);
            //     // APP_ERROR_CHECK(err_code);
            // }

            // // Pass change IMU settings to event handler
            // err_code = app_sched_event_put(0, 0, imu_config_evt_sceduled);
            // APP_ERROR_CHECK(err_code);

            break;

        case BLE_TMS_EVT_NOTIF_PEDOMETER:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_PEDOMETER - %d\r\n", p_tms->is_pedo_notif_enabled);
            // if (p_tms->is_pedo_notif_enabled)
            // {
            //     err_code = drv_motion_enable(DRV_MOTION_FEATURE_MASK_PEDOMETER);
            //     APP_ERROR_CHECK(err_code);
            // }
            // else
            // {
            //     err_code = drv_motion_disable(DRV_MOTION_FEATURE_MASK_PEDOMETER);
            //     APP_ERROR_CHECK(err_code);
            // }
            break;

