jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


static void print_sync_time()
{
    uint64_t time_now_ticks;
    uint32_t time_now_msec;
    uint32_t time_ticks;

    time_now_ticks = ts_timestamp_get_ticks_u64();
    time_now_msec = TIME_SYNC_TIMESTAMP_TO_USEC(time_now_ticks) / 1000;
    time_ticks = TIME_SYNC_MSEC_TO_TICK(time_now_msec);
    NRF_LOG_INFO("Time: ticks %d - ms %d", time_ticks, time_now_msec);
}

// Event handler DIY
/**@brief GPIOTE sceduled handler, executed in main-context.
 */
void imu_config_evt_sceduled(void * p_event_data, uint16_t event_size)
{
		// Enable sensor parameters based on received configuration
		ret_code_t err_code;

        // Clear all buffers before starting a new measurement
        imu_clear_buff();

        #if IMU_ENABLED == 1
		err_code =  imu_enable_sensors(&imu);
		APP_ERROR_CHECK(err_code);
        #endif

        ts.sync_interval_int_time = (imu.period / 2.5);        

        // Temp for debugging
        print_sync_time();

        NRF_LOG_INFO("ime.sync_start_time %d", imu.sync_start_time);

        if( ( imu.sync ) && ( imu.sync_start_time != 0) )
        {
        err_code = ts_set_trigger(imu.sync_start_time, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
        APP_ERROR_CHECK(err_code);
        ts.m_imu_trigger_enabled = 1 ;
        }else{
            ts.m_imu_trigger_enabled = 0;
        }

        NRF_LOG_INFO("ts.sync_interval_int_time: %d", ts.sync_interval_int_time);

        // TODO: ADC needs to be implemented
        // adc_enable(imu);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    ret_code_t err_code;
	
    switch (p_evt->type)
    {
        case BLE_NUS_EVT_RX_DATA:				
                // Pass change IMU settings to event handler
                err_code = app_sched_event_put(0, 0, imu_config_evt_sceduled);
                APP_ERROR_CHECK(err_code);
            break;
                
            // Added //
            // When BLE NUS
        case BLE_NUS_EVT_TX_RDY:
                nus_buffer_full = false;
//				NRF_LOG_INFO("BLE_NUS_EVT_TX_RDY");
            break;
        case BLE_NUS_EVT_COMM_STARTED:
                NRF_LOG_DEBUG("BLE_NUS_EVT_COMM_STARTED");
            break;
        case BLE_NUS_EVT_COMM_STOPPED:
                NRF_LOG_DEBUG("BLE_NUS_EVT_COMM_STOPPED");
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over BLE] */

static void usr_qwr_init()
{
    uint32_t           err_code;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);
}

static void usr_ble_nus_init()
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);    
}



static void usr_tms_init(void)
{
    ret_code_t err_code;
    ble_tms_init_t        tms_init;

    memset(&tms_init, 0, sizeof(tms_init));

    // Init with all parameters to default value
    tms_init.p_init_config->gyro_enabled = 0;
    tms_init.p_init_config->accel_enabled = 0;
    tms_init.p_init_config->mag_enabled = 0;
    tms_init.p_init_config->euler_enabled = 0;
    tms_init.p_init_config->quat6_enabled = 0;
    tms_init.p_init_config->quat9_enabled = 0;
    tms_init.p_init_config->wom_enabled = 1;
    tms_init.p_init_config->motion_freq_hz = 100;

    tms_init.evt_handler = ble_tms_evt_handler;

    err_code = ble_tms_init(&m_tms, &tms_init);
    APP_ERROR_CHECK(err_code);
}

static void usr_bas_init(void)
{
    ret_code_t err_code;
    ble_bas_init_t     bas_init;
    
    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    // Here the sec level for the Battery Service can be changed/increased.
    bas_init.bl_rd_sec        = SEC_OPEN;
    bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    bas_init.bl_report_rd_sec = SEC_OPEN;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    // Initialize Queued write module: for write requests (used by NUS + TMS)
    usr_qwr_init();

    // Initialize BLE NUS module
    usr_ble_nus_init();

    // Init TMS service
    usr_tms_init();

    // Initialize Battery service
    usr_bas_init();
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

